{
 "initialLoad": false,
 "views": [
  {
   "src": "./src/views/blogEntryLayout.jade",
   "contents": "extends layout.jade\n\nblock pageTitle\n  title\n    != entry.meta.title\n\nblock content\n  include blogEntryPartial\n"
  },
  {
   "src": "./src/views/blogEntryPartial.jade",
   "contents": "article\n  header\n    h2= entry.meta.title\n    time= moment(entry.meta.publishedAt).format(\"MMMM Do YYYY\")\n  != entry.markdownContent\n"
  },
  {
   "src": "./src/views/layout.jade",
   "contents": "doctype html\nhtml(lang=\"en\")\n  head\n    meta(charset='utf-8')\n    meta(http-equiv='X-UA-Compatible', content='IE=edge,chrome=1')\n    meta(name='HandheldFriendly', content='True')\n    meta(name='MobileOptimized', content='320')\n    meta(name='viewport', content='width=device-width, minimum-scale=1.0, maximum-scale=1.0')\n    link(href='/style.css', rel='stylesheet', type=\"text/css\")\n    block pageTitle\n      title exact change only\n    script.\n      (function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){\n      (i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),\n      m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)\n      })(window,document,'script','//www.google-analytics.com/analytics.js','ga');\n      ga('create', 'UA-47887894-1', 'auto');\n      ga('send', 'pageview');\n  body\n    main\n      block content\n        != page.content\n    nav\n      //- img#profile(src=\"/evilShroom.png\")\n      a(href=\"/\") #[h1.site_title exact change only]\n      a(href=\"/resume.html\") resume.html\n      br\n      - for page in pages\n        a(href=page.url)= page.title\n        br\n      a(href=\"mailto:\" + package.author.email)= package.author.email\n      br\n      a(href=package.repository.url) v#{package.version}\n      br\n      span #{moment().format()}\n"
  },
  {
   "src": "./src/views/page.jade",
   "contents": "extends layout.jade\n\nblock pageTitle\n  title= page.url\n\nblock content\n  != page.content\n"
  }
 ],
 "pages": [
  {
   "src": "./src/pages/aboutMe.jade",
   "contents": "extends ../views/layout.jade\n\nblock content\n  h1 about me\n\n  p\n    |My name is Adam Wong. I'm living in beautiful Portland Oregon and working for \n    a(href=\"https://chroma.fund\") chroma \n    |where I double as a full stack computer wizard, amateur designer and wannabe economics hacker. I have a wonderful boyfriend, Vince, and 2 dogs. I also drink too much coffee and I'm obsessed with Soylent.\n\n  :markdown\n    ---\n\n    ## side projects\n    ### exact change only\n    [my homemade static blog generator](https://github.com/adamwong246/adamwong246.github.io)\n\n    ### tymtu\n    #### (pronounced 'time to')\n\n    [tymtu](https://bitbucket.org/adamwong246/tymtu) is an experimental hierarchical calendar\n\n    ### freak flag\n\n    [freak flag](https://github.com/adamwong246/freakFlag) is chat app for freaks\n\n    ### dotfiles\n\n    https://github.com/adamwong246/dotfiles\n\n    a collection of configuration files with an grunt based theme builder\n\n    ### ifailedtheturingtest\n\n    http://ifailedtheturingtest.herokuapp.com/\n\n    My old personal blog. It's a lot more complex than this blog. No longer maintained.\n\n  hr\n\n  h2 Social accounts\n\n  ul\n    li #[a(href=\"https://news.ycombinator.com/user?id=adamwong246\") hacker news ]\n    li #[a(href=\"http://github.com/adamwong246\") github]\n    li #[a(href=\"https://www.linkedin.com/in/adam-wong-4634421b\") linkedin]\n    li #[a(href=\"http://stackexchange.com/users/304854/adamwong246?tab=top\") stack exchange]\n    li #[a(href=\"https://www.reddit.com/user/adamwong246\") reddit ]\n    li #[a(href=\"https://www.facebook.com/adamwong246\") facebook ]\n    li #[a(href=\"https://twitter.com/adamwong246\") twitter]\n    li #[a(href=\"https://www.instagram.com/adamwong246/\") instagram]\n    li #[a(href=\"https://plus.google.com/104202656400776521456\") google+]\n    li #[a(href=\"https://soundcloud.com/adamwong246\") soundcloud]\n    li #[a(href=\"https://www.pinterest.com/adamwong246/\") pinterest]\n    li #[a(href=\"http://adamwong246.tumblr.com/\") tumblr]\n    li #[a(href=\"https://www.producthunt.com/@adamwong246\") product hunt]\n"
  },
  {
   "src": "./src/pages/blog.jade",
   "contents": "extends ../views/layout.jade\n\nblock content\n  ul\n    - for entry in blogEntries\n      li #[a(href=entry.url)= entry.meta.title]\n"
  },
  {
   "src": "./src/pages/index.jade",
   "contents": "extends ../views/layout.jade\n\nblock content\n  - for entry in blogEntries\n    include ../views/blogEntryPartial\n    hr\n    asdasd\n    \n"
  }
 ],
 "blogEntries": [
  {
   "src": "./src/blogEntries/0/index.md",
   "contents": "---\ntitle: First post\npublishedAt: Thu Feb 11 2015 15:47:27 GMT-0800 (PST)\npublish: false\n---\n\nThis is my first blog post!!!!\n"
  },
  {
   "src": "./src/blogEntries/1/index.md",
   "contents": "---\ntitle: Soylent, day to day?\npublishedAt: Thu Feb 12 2015 15:47:27 GMT-0800 (PST)\n---\n\nEver since I backed Soylent on Kickstarter, I've been a little obsessed with the stuff. Well, \"obsessed\" might not be the right word... \"consumed\" might be a better. \"Evangelical\" has been tossed around. Seriously, a day does not go by when I do not attempt to bring some poor soul into fold. If someone asks what biege slurry I'm gulping down, I launch into a full scale attack to win the hearts and minds of \"fooders\" and turn them into \"Soylentarians.\"\n\n### What's in it?\n\nMostly sugar. Maltodextrin to be specific. Sugars are molecules in the form of a chain. Shorter chains are the sugars you are most familiar with. Table sugar, HFC's glucose, sucrose and fructose fall into this category. Long chains are your breads, pastas and rice- all the starches. Maltodextrin is \"medium\" length, so it doesn't taste very sweet. Your body \"burns\" these sugars more slowly than candy-sugar but faster than pasta-sugar. Next comes oats and brown rice flour. These provide your protein and fiber. Everything else is your vitamins and minerals. Lastly, don't forget the oils! We need oil in our diet and every daily allotment of Soylent includes a vial of oil.\n\nStrangely, Soylent is missing 100% a crucial ingredient- salt!. This only matters if you eat Soylent and Soylent alone or you run marathons. Ordinary food, even when supplemented by Soylent, provides more than enough salt. I think they skimped on this to improve the taste.\n\n### How do you get it?\n\nOrder it online. You can get 1 weeks, 2 weeks or 4 weeks worth of Soylent at a time. If you buy the subscription, you get a discount. If it's your first order, it's going to take a long time. Go complain about it on the forums but it won't do any good. It took me a year and half to get mine! But after your first shipment, latter orders arrive much faster.\n\n### How do you make it?\n\nEach daily serving of Soylent is a bag of powder and a vial of oil. Put the powder in the pitcher and add water. Shake until well mixed. Add the oil and shake again. Serve chilled. Each pitcher is 2000 calories- the FDA recommended amount of *everything*. I divide it up into 2 meals and snack, in 3 of those shaker bottles, so it's not unusual for me to eat nothing but Soylent and coffee.\n\n### What's it taste like?\n\nI would not be ungracious if I said Soylent tastes a bit like Play Do. Not in a bad way though. It's slightly sweet but more than anything at all, it's utterly bland. There's a distinct texture which has been described as \"silty.\" I don't find it unpleasant but others do. I don't understand this at all- my best guess is that it's a subconscious bias.\n\n### What's it like living on Soylent?\n\nWell, first, I don't live on Soylent alone and I don't recommend anyone try. Living on Soylent alone would be a sad existence. It's also more dangerous than even I dare to tread. Though I consume more than 50% of my food as Soylent, I'm still wary about the long term effects. But more than that, food is good and after eating Soylent for breakfast and lunch, by dinner I want sweet, salty, spicy food! I can't stress this enough. After the blandness of Soylent, \"real\" food tastes extraordinary. Your taste buds get reset and you can't help but ruminate on your food. The tastes and textures are so much more pronounced, even boring foods like toast are exciting. But our modern foods are absolutely bursting with sugar, salt and fat and with a fresh palette spicy chicken wings, Doritos, chocolate and Dr Pepper will absolutely blow your mind! It's like eating again for the first time.\n\nAnother big change is that you have more of your most important resources- time and money. If you were like me, you were spending up to $20 a day on food and over an hour of time shopping, cooking, eating and then cleaning up after. On Soylent, you can make all 3 meals in 60 seconds, for less than 10 bucks. There are days when the dishwasher is full of nothing but the pitcher and shaker bottles.\n\n### What are the downsides?\n\nThe worst problem is well documented on the forums- Solent Farts. It's advised that you gradually increase your Soylent intake, as to give your gut a chance to adjust. Otherwise you can expect some really explosive gas. \"Fart\" really is an insufficient term- I had *tremendous* gas, so much so that it hurt my abdomen digesting Soylent. GasX and Beano are prescribed but theres quite a few solutions floating around the forums. Thankfully, these symptoms subside eventually. I haven't had any gas at all after v1.3 but your mileage may vary.\n\nAnother problem is one of will power. Like I said, Soylent makes you appreciate the sensation of eating real food. Soylent nourishes the body but not the soul. If your not careful, you will find yourself walking out of the grocery store with a pint of ice cream, spicy Doritos and soda cause it tastes that darn good. And you'll find it easier to rationalize to yourself, because you ate 2 solid healthy meals. This is alleviated by forcing yourself to cook. The Soylentarian lifestyle affords you much more time, money and energy to devote to real food, when the modd strikes you. Use your newfound resources to learn to cook again. At my house, we have 5 roommates but we try to eat dinner together. It's an important human ritual, one I didn't appreciate until it was gone. Cooking can be fun and rewarding. Eating can be an aesthetic experience. Both should be social opportunities.\n\nLastly, you *will* run into anti-Soylentarians. There's a lot of them in Portland and I'm sure you know the type. Nutrition-istas and Food Babes everywhere will grimace with horror as you down your Soylent. Just smile back and direct them to the forums, where all manner of nutritional arguments are held.\n"
  },
  {
   "src": "./src/blogEntries/10/index.md",
   "contents": "---\ntitle: Philosophy of Music Design in Games - Fez\npublishedAt: Thu Aug 25 2016 11:20:28 GMT-0400 (EDT)\n---\n\n<div class=\"video-container\">\n<iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/Pl86ND_c5Og\" frameborder=\"0\" allowfullscreen></iframe>\n</div>\n"
  },
  {
   "src": "./src/blogEntries/11/index.md",
   "contents": "---\ntitle: Syntax highlight test\npublishedAt: Sat Aug 27 2016 13:54:20 GMT-0400 (EDT)\npublish: false\n---\n\n```css\n#button {\n\tborder: none;\n}\n```\n"
  },
  {
   "src": "./src/blogEntries/12/index.md",
   "contents": "---\ntitle: Creating a multi-emulator machine\npublishedAt: Mon Oct 24 2016 10:29:14 GMT-0700 (PDT)\n---\n\nChache loves old Sega games but I grew up in a Nintendo house so I built an multi-emulator machine.\n\n### Get some hardware, install Lakka and boot up\n\nYou'll need an old PC, laptop, or even a RassberryPi, anything you can install linux on. I'm using my ancient but trusty Asus EEE PC.\n\n[Lakka](http://www.lakka.tv/get/) is a linux distro which is mostly just the RetroArch frontend. You could also install LibRetro on an existing linux system through aptitude, but I wanted to do the full OS install.\n\n![booting.](booting.jpg)\n\n### Troubleshoot\n\nThe first real problem I had was that, by default, my pokey machine couldn't render the complex background of the menu quickly. The result was a nearly unuseable. But by turning off the option `Settings >  Menu > Menu Shader Pipeline` to \"off\", navigating the menu was much faster. Next, I changed `Settings >  Menu > Show Advanced Settings` to \"On\", so that I could access \"Settings > Video > Monitor Index.\" Changing this to \"2\" allowed me to use the VGA connection, rather than the built-in screen.\n\nFor the nerds, you can also do this through the command line. First obtain the IP address of the Lakka machine\n\n```\nadam@babbage ~/Downloads sudo arp-scan --interface=en0 --localnet\nPassword:\nInterface: en0, datalink type: EN10MB (Ethernet)\nStarting arp-scan 1.9 with 256 hosts (http://www.nta-monitor.com/tools/arp-scan/)\n192.168.1.1     00:25:9c:66:c5:8d       Cisco-Linksys, LLC\n192.168.1.100   70:73:cb:e9:d1:7e       Apple, Inc.\n192.168.1.113   00:26:18:41:d9:65       ASUSTek COMPUTER INC.\n192.168.1.111   6c:ad:f8:7d:3c:6b       Azurewave Technologies, Inc.\n...\n```\n\nFrom this, we see the Asus netbook is online at address 192.168.1.113. Next, I used `ssh` to access the machine. Hint: the username and password are both \"root.\" Yes, this is terrible but I didn't set it up this way!\n\n```\nadam@babbage ~/Downloads ssh root@192.168.1.113\nroot@192.168.1.113's password:\n###########################################\n# Lakka - The DIY retro emulation console #\n# ...... visit http://www.lakka.tv ...... #\n###########################################\n\nLakka (unofficial) Version: devel-20161002110423-r21593-g03241bf\nLakka git: 03241bf2ccf3fbf6f71d04489e02ae3cee8565e1\nLakka:~ #\n```\n\nand voila, you have a very simple linux command line. From here, you must first stop RetroArch\n\n```\nLakka:~ # systemctl stop retroarch\n```\n\nthen you can edit `.config/retroarch/retroarch.cfg`, with `vi` or `nano`. For example, you might change the setting called `video_monitor_index` from \"0\" to \"2.\" After saving the file, restart RetroArch.\n\n```\nLakka:~ # systemctl start retroarch\n```\n\n### Connect and sync controllers\n\n![controllers.](controllers.jpg)\n\nI use Xbox wireless controllers with a charging cradle. Just plug the receiver into the usb of the netbook, press the button and the Xbox button on the controller themselves. They connected right away and I had no problems at all.\n\n### Download ROMs\n\n![mm2.](mm2.jpg)\n\nGet all your ROMs together and use `scp` to move the files onto the netbook. Again, use `arp-scan` to first obtain the IP address of the Lakka machine.\n\n```\nscp -r * root@192.168.1.113:roms/\n```\n\nNow by returning the the Main Menu, you can select `Main Menu > Load Content`, you run your ROMs.\n\n### Enjoy!\n\nAt this point, your system is basically done. I've not been able to load any n64 or playstation games, but all the older systems, including Sega Genesis and arcade seem to work just fine. Just hit \"VGA\" on the remote and grab a controller!\n\n## further work\n\n### Write playlists\n\nThe menu is pretty difficult to navigate, so it would be nicer to have playlists of games. Lakka makes some crude attempts to generate playlists for you but it's pretty lacking. SSH into the machine and use vim to edit the file in `/playlists` [as described here](https://github.com/libretro/Lakka/wiki/Playlists) and lists of games will appear on the root menu.\n\n### Boxart\n\nLakka can be configured to download the boxart for games.\n\n## Thoughts\n\nWhen I first booted Lakka, I couldn't accomplish anything because of the lag caused by the background pattern. Considering my netbook has about the stats as a RassberryPi, I think the contributors should set `Menu Shader Pipeline` to \"off\" by default.\n\nIt would be really nice to be able to edit the files from the Finder. You should be able to pick up the filesystem in the sidebar of your file browser. Sometimes this worked, but mostly didn't. \n"
  },
  {
   "src": "./src/blogEntries/13/index.md",
   "contents": "---\ntitle: migrating away from coffeescript\npublishedAt: Thu Oct 27 2016 14:12:53 GMT-0700 (PDT)\n---\n\nSadly, its' time to let go of coffee and change with the time. I'm rewriting it all for ES7, taking advantage of better async stuff. It's too bad cause I loved coffeescript's syntax so much.\n"
  },
  {
   "src": "./src/blogEntries/2/index.md",
   "contents": "---\ntitle: Generators\npublishedAt: Thu Feb 12 2015 15:47:27 GMT-0800 (PST)\npublish: false\n---\n\nThis entry was auto-generated and includes a `publishedAt` time stamp.\n"
  },
  {
   "src": "./src/blogEntries/3/index.md",
   "contents": "---\ntitle: Dogs\npublishedAt: Thu Feb 12 2015 15:47:27 GMT-0800 (PST)\n---\n\n![This is a picture of my dogs.](dogs.jpg)\n"
  },
  {
   "src": "./src/blogEntries/4/index.md",
   "contents": "---\ntitle: Status update\npublishedAt: Tue Feb 17 2015 18:13:16 GMT-0800 (PST)\ntags:\n  - status_update\n---\n\n- I used [Normalize.css](http://necolas.github.io/normalize.css/) for a base, [Holy Grail](http://philipwalton.github.io/solved-by-flexbox/demos/holy-grail/) to implement a fluid layout and a sticky footer and for typography, [Typebase.css](http://devinhunt.github.io/typebase.css/). Of course, I've added my own [light touch](https://github.com/adamwong246/adamwong246.github.io/blob/master/_src/style.css) but so far, it's quite a neutral theme.\n- Each blog is now routed to a nicer url and jpgs included in the same file get re-mapped to a absolute url, so managing images for specific blog entries is easy.\n- I used the same technique that generates my resume to turn the `README.md` into an html file.\n\nOf course, you can see for yourself by [tracking the commits on github](https://github.com/adamwong246/adamwong246.github.io/commits/master)! And if you wanted to see what's next on my todo list, check out the [issues](https://github.com/adamwong246/adamwong246.github.io/issues).\n\nFinally, I bumped the version to `0.1.0`, which according to SemVer I should have done already. \n"
  },
  {
   "src": "./src/blogEntries/5/index.md",
   "contents": "---\ntitle: \"Meteor: the first month\"\npublishedAt: Sat Mar 21 2015 08:49:37 GMT-0700 (PDT)\n---\n\nThere's an exciting new stack for optimistic developers called Meteor and I've had the great pleasure of focusing on learning it for the past months. This is what I've learned.\n\nMeteor is framework based on the high-minded ideal of *isomorphic* javascript, which is a fancy way of saying, \"It's javascript, on the server too!\" I find this notion absolutely titilating, though I'm sure other's are heaving at the very thought. Ok, that's fair. But give it a chance! It's an incredibly flexible technology and with a little bit of experience, you'll find that Meteor is a fantastic tool for building prototypes which evolve into mature software. Meteor is production ready and the time to dive in is now!\n\n## The basics\n\n### Meteor is not like Rails.\n\nI'm a RoR guy. I bet if you are reading this, there's a good chance that you cut your teeth on Rails. **Forget all of it.**\n\nMeteor does not use HTTP to communicate between the server and client. Rather, it uses Websockets and the Distributed Data Protocol (DDP) to create magical, reactive variables which map Mongo documents to the view.\n\nMeteor uses Collections to store individual documents but by publishing and subscribing to other collections over DDP. This feels weird, at first, but it's actually quite natural.\n\nThe server publishes some orders\n\n```\n\nMeteor.publish 'validOrders' ->\n Orders.find {'valid': true}, {userId: 0}\n\n\nMeteor.publish 'myOrders' ->\n Orders.find {'userId': Meteor.userId()}\n\n```\n\nand the client subscribes\n```\nMeteor.subscribe 'orders'\nMeteor.subscribe 'myOrders'\n```\n\nHence, the client *has access* to a subset of all Order documents. You can even limit not just a set documents, but rather whitelist and blacklist certain attributes. This is an important distinction. The client now has access to\n\n- Orders of which \"belong\" to said users\n- Orders which are valid but not the userId fields\n\nAnd this subscription is now reactive and those order directly map to HTML through you handlebars templates. And the client is usually requesting a subset of records based on a query.\n\n```\nTemplate.example.helpers\n orders: ->\n  Orders.find({active: true})\n```\n\nTherefore, the documents which are shared are the overlap between these 2 subsets- those published by the server and those queried from a helper.\n\nOf course, if you are a beginner, you've got the autopublish package installed and every document is simply available to the client. That's fine for now but don't leave it in your app forever.\n\nA similar package to look out for is the `insecure` which allows the \"client to write to the database\". It think this is a bit of a mischaracterization, because the client can't ever \"write to the database\", only call Meteor Methods. The `insecure` package simply implement this niavely- you'l want your version of the same methods to have more security\n\nOverall, the impression upon me is very different from Rails. Rails is about strict separation of logic and view, with a controller to handle the details of http. Meteor is less \"opinionated\" but it forces you to deal more directly with details in a less abstract way. You need to understand the underlying technology, rather than Rails's curated DSL's. Out of the box, Meteor enforces no MVP, though you *could* implement such. Be careful, because without those rails, it's easy to tangle your logic and your implementation!\n\n### Meteor is backed by a mongo db and loves JSON\nAdios SQL! I've personally always despised SQL. I *get* it, sort of, but it never felt natural. Mongo is a breath of fresh air. Not only is every document a plain JSON object, queries are also JSON. Yes, you can have a schema, if you want. Yes, migrations are an real consideration and you have to manage joins yourself.\n\n### Meteor requires **yet another** package manger.\nIt is, however, a very nice and necessary.\n\n### It uses a lot of RAM\nBut RAM is cheap, so it's not a big deal most of the time.\n\n### But it's still just js\nLet's face facts: node's asynchronous support is overhyped. Sure, it powerful but the community is fragmented on how to support asynchronous operations. Promises, threads, futures, generators, etc are absolutely overwhelming and bewildering. Meteor does it's best to shield you from these concerns but you'll still have to tackle these complex issues at some point.\n"
  },
  {
   "src": "./src/blogEntries/6/index.md",
   "contents": "---\ntitle: Something he’d found and lost so many times\npublishedAt: Wed Apr 29 2015 19:32:31 GMT-0700 (PDT)\n---\n\n> It belonged, he knew – he remembered – as she pulled him down, to the meat, the flesh the cowboys mocked. It was a vast thing, beyond knowing, a sea of information coded in spiral and pheromone, infinite intricacy that only the body, in its strong blind way, could ever read.” \n― William Gibson, Neuromancer\n"
  },
  {
   "src": "./src/blogEntries/7/index.md",
   "contents": "---\ntitle: Removed typebase and pdf rendering\npublishedAt: Sun Aug 21 2016 15:40:20 GMT-0400 (EDT)\n---\n\nI removed typebase and also markdown2pdf. My resume is now rendered to PDF by the browser.\n"
  },
  {
   "src": "./src/blogEntries/8/index.md",
   "contents": "---\ntitle: image pipeline test\npublishedAt: Mon Aug 22 2016 20:17:34 GMT-0400 (EDT)\npublish: false\n---\n\n![test 0](roboWarrior.jpg)\n![test 1](videoPattern.jpg)\n"
  },
  {
   "src": "./src/blogEntries/9/index.md",
   "contents": "---\ntitle: Added an image pipeline\npublishedAt: Mon Aug 22 2016 20:24:11 GMT-0400 (EDT)\npublish: false\n---\n\nToday, I add 'lwip', or 'lightweight image processor' which optimizes images. The test results are [here](/blog/8-image-pipeline-test/)\n\nIt also preserves the originals.\n- [original roboWarrior](/blog/8-image-pipeline-test/orig-roboWarrior.jpg)\n- [original videoPattern](/blog/8-image-pipeline-test/orig-videoPattern.jpg)\n"
  }
 ],
 "css": [
  {
   "src": "./src/assets/moreStyle.css",
   "contents": "body {\n  background-color: white;\n}\n"
  },
  {
   "src": "./src/assets/style.css",
   "contents": "@media (-webkit-min-device-pixel-ratio: 1.5), (min-resolution: 144dpi), (min-resolution: 1.5dppx) {\n  html {\n    font-weight: 300;\n  }\n}\n\nbody {\n  display: flex;\n  min-height: 100vh;\n  flex-direction: column;\n  flex: 1 0 auto; /* 2 */\n  padding-left: 1.5em;\n  padding-right: 1.5em;\n}\n\nmain {\n  flex: 1;\n}\n\nnav {\n  order: -1;\n  padding: 1em;\n  border-radius: 3px;\n  background: rgba(147, 128, 108, 0.1);\n}\n\n@media (min-width: 768px) {\n  body {\n    flex-direction: row;\n  }\n  main {\n    flex: 1;\n    padding: 0 2em;\n    margin-top: 1.5em;\n  }\n}\n\nimg {max-width:100%;}\n\nimg#profile{\n  width: 5em;\n  display: block;\n  margin-left: auto;\n  margin-right: auto;\n}\n\np, li {max-width:35rem;}\n\nnav ul{\n  -webkit-padding-start: 0px;\n  list-style: none;\n}\n\nh2{\n  margin-bottom: 0.2em;\n}\n\nheader {\n  padding-top: 1.5em;\n  padding-left: 1.5em;\n  padding-right: 1.5em;\n}\n\nbody > header > *{\n padding: 1em;\n margin: 0em;\n border-radius: 3px;\n background: rgba(147, 128, 108, 0.1);\n}\n\n@media print\n{\n  nav {\n    display: none !important;\n  }\n}\n\n/*http://avexdesigns.com/responsive-youtube-embed/*/\n.video-container {\n    position: relative;\n    padding-bottom: 56.25%;\n    padding-top: 30px; height: 0; overflow: hidden;\n}\n\n.video-container iframe,\n.video-container object,\n.video-container embed {\n    position: absolute;\n    top: 0;\n    left: 0;\n    width: 100%;\n    height: 100%;\n}\n"
  }
 ],
 "license": [
  {
   "src": "./src/LICENSE.txt",
   "contents": "LICENSE.txt\n\nhello world\n"
  }
 ],
 "resume": [
  {
   "src": "./src/resume.md",
   "contents": "# Adam Wong\n\n- adamwong246@gmail.com\n- Portland, OR\n\n## Technical Skills\n\n- Typescript, React, Node, Meteor, Ruby on Rails\n- Docker and DockerHub\n- Github, Heroku Jenkins and Amazon AWS \n- Java and Android\n- BDD and TDD methodologies\n- certified Scrum Master\n\n## Experience\n\n### software engineer, [OpenGov](http://www.opengov.com/)\n\n#### November, 2016 - Current\n\n- implemented charts in D3 and react\n- developed a continuous integration and delivery process with Jenkins, Docker and AWS.\n\n### full stack developer, [Chroma](http://www.chroma.io/)\n\n#### February, 2015 - August, 2016\n\nI engineered the Meteor app \"Chroma Fund\", a marketplace lending platform providing investors with bundles of small business loans.\n\n- responsible for designing UX and UI as well as implementing front-end\n- supported blockchain verifiable transactions\n- created \"explainer\" video in Adobe Animate\n- attended TechStars Summer 2016 in NYC\n\n### Ruby on Rails developer, [Hubbub Health](https://www.hubbubhealth.com/)\n\n#### May, 2013 - February, 2015\n\nI worked with a large team to incentivize employee wellness with the RoR app, [hubbubhealth.com](hubbubhealth.com).\n\n- wrote Javascript for both modern and legacy browsers\n- debugged user-submitted errors with New Relic and Papertrail\n- managed assets via Amazon S3\n- revived an out of date Rspec and Cucumber test suite for continuous integration\n- optimized high traffic queries by replacing ActiveRecord calls with raw SQL\n\n### Ruby on Rails developer, Spaceport\n\n#### June 2012 - March, 2013\n\nI developed the RoR app, spaceport.io, a platform for porting Actionscript games to iOS and Android.\n\n- maintained an extensive, pre-existing test suite via Jenkins\n- created responsive/fluid designs with Twitter Bootstrap\n- developed according to BDD methodologies using Cucumber\n- leveraged the Chargify API to enable payments\n\n### Android developer, [Burnside Digital](http://www.burnsidedigital.com) (formerly ELC Technologies)\n\n#### April 2011 - April 2012\n\nI developed Android apps as part of an Agile team that spanned across Android, iOs, Windows and Web platforms.\n\n- traveled to Palo Alto, California to work with Google\n- formally trained in Agile and Scrum methods and practices\n- examples of work include the well received Postcard on the Run Android app\n\n## Education\n\n- University of South Carolina\n- Bachelors of Computer Science,  May 2010\n"
  }
 ]
}